



MPLS Working Group                                                X. Min
Internet-Draft                                                   S. Peng
Intended status: Standards Track                               ZTE Corp.
Expires: 5 September 2022                                   4 March 2022


  Label Switched Path (LSP) Ping for Segment Routing (SR) Path Segment
                Identifiers (SIDs) with MPLS Data Planes
               draft-xp-mpls-spring-lsp-ping-path-sid-03

Abstract

   Path Segment is a type of SR segment, which is used to identify an SR
   path.  This document provides Target Forwarding Equivalence Class
   (FEC) stack TLV definitions for Path Segment Identifiers.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on 5 September 2022.

Copyright Notice

   Copyright (c) 2022 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents (https://trustee.ietf.org/
   license-info) in effect on the date of publication of this document.
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.  Code Components
   extracted from this document must include Revised BSD License text as
   described in Section 4.e of the Trust Legal Provisions and are
   provided without warranty as described in the Revised BSD License.





Min & Peng              Expires 5 September 2022                [Page 1]

Internet-Draft          LSP Ping for SR Path SID              March 2022


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Conventions . . . . . . . . . . . . . . . . . . . . . . . . .   2
     2.1.  Requirements Language . . . . . . . . . . . . . . . . . .   2
     2.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Path Segment ID Sub-TLV . . . . . . . . . . . . . . . . . . .   3
     3.1.  SR Policy's Path SID  . . . . . . . . . . . . . . . . . .   3
     3.2.  SR Candidate Path's Path SID  . . . . . . . . . . . . . .   5
     3.3.  SR Segment List's Path SID  . . . . . . . . . . . . . . .   7
   4.  Path-SID FEC Validation . . . . . . . . . . . . . . . . . . .   9
   5.  Security Considerations . . . . . . . . . . . . . . . . . . .  13
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  14
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  14
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  14
     8.1.  Normative References  . . . . . . . . . . . . . . . . . .  14
     8.2.  Informative References  . . . . . . . . . . . . . . . . .  15
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  17

1.  Introduction

   Path Segment is a type of SR segment, which is used to identify an SR
   path.  Path Segment in MPLS based segment routing network is defined
   in [I-D.ietf-spring-mpls-path-segment].

   When Path Segment is used, it's inserted by the ingress node of the
   SR path, and then processed by the egress node of the SR path.  The
   position of Path Segment Label within the MPLS label stack is
   immediately following the segment list of the SR path.  Note that the
   Path Segment would not be popped up until it reaches the egress node.

   This document provides Target Forwarding Equivalence Class (FEC)
   stack TLV definitions for Path-SIDs.  Procedures for LSP Ping as
   defined in [RFC8287] and [RFC8690] are applicable to Path-SIDs as
   well.

2.  Conventions

2.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.






Min & Peng              Expires 5 September 2022                [Page 2]

Internet-Draft          LSP Ping for SR Path SID              March 2022


2.2.  Terminology

   This document uses the terminology defined in [RFC8402] and
   [RFC8029], readers are expected to be familiar with those terms.

3.  Path Segment ID Sub-TLV

   Analogous to what's defined in Section 5 of [RFC8287] and Section 4
   of [I-D.ietf-mpls-sr-epe-oam], three new sub-TLVs are defined for the
   Target FEC Stack TLV (Type 1), the Reverse-Path Target FEC Stack TLV
   (Type 16), and the Reply Path TLV (Type 21).


        Sub-Type    Sub-TLV Name
        --------    -----------------------------
         TBD1       SR Policy's Path SID
         TBD2       SR Candidate Path's Path SID
         TBD3       SR Segment List's Path SID

   As specified in Section 2 of [I-D.ietf-spring-mpls-path-segment], the
   Path Segment may be used to identify an SR Policy, its Candidate
   Path, or a Segment List, so three different Target FEC sub-TLVs need
   to be defined for Path Segment ID.  When a Path Segment is used to
   identify an SR Policy, the Target FEC sub-TLV of SR Policy's Path SID
   would be used to validate the control plane to forwarding plane
   synchronization for this Path-SID; When a Path Segment is used to
   identify an SR Candidate Path, the Target FEC sub-TLV of SR Candidate
   Path's Path SID would be used to validate the control plane to
   forwarding plane synchronization for this Path-SID; When a Path
   Segment is used to identify a Segment List, the Target FEC sub-TLV of
   SR Segment List's Path SID would be used to validate the control
   plane to forwarding plane synchronization for this Path-SID.  Note
   that the three new Target FEC sub-TLVs are mutual exclusive and they
   wouldn't be present in one message simultaneously.

3.1.  SR Policy's Path SID

   The format of SR Policy's Path SID sub-TLV is as specified below:













Min & Peng              Expires 5 September 2022                [Page 3]

Internet-Draft          LSP Ping for SR Path SID              March 2022


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Type = TBD1          |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   ~                     Headend  (4/16 octets)                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Color  (4 octets)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   ~                    Endpoint  (4/16 octets)                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                   Figure 1: SR Policy's Path SID sub-TLV

   Type

      This field is set to the value (TBD1) which indicates that it's an
      SR Policy's Path SID sub-TLV.

   Length

      This field is set to the length of the sub-TLV's Value field in
      octets.  If Headend and Endpoint fields are in IPv4 address format
      which is 4 octets long, it MUST be set to 12; If Headend and
      Endpoint fields are in IPv6 address format which is 16 octets
      long, it MUST be set to 36.

   Headend

      This field identifies the headend of an SR Policy, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The headend is a
      4-octet IPv4 address or a 16-octet IPv6 address.

   Color

      This field associates the SR Policy with an intent, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The color is a 4-octet
      numerical value.

   Endpoint

      This field identifies the endpoint of an SR Policy, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The endpoint is a
      4-octet IPv4 address or a 16-octet IPv6 address.




Min & Peng              Expires 5 September 2022                [Page 4]

Internet-Draft          LSP Ping for SR Path SID              March 2022


3.2.  SR Candidate Path's Path SID

   The format of SR Candidate Path's Path SID sub-TLV is as specified
   below:


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Type = TBD2          |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   ~                     Headend  (4/16 octets)                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Color  (4 octets)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   ~                    Endpoint  (4/16 octets)                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |Protocol-Origin|                    Reserved                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                                                               |
   |                  Originator  (20 octets)                      |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |               Discriminator  (4 octets)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

               Figure 2: SR Candidate Path's Path SID sub-TLV

   Type

      This field is set to the value (TBD2) which indicates that it's an
      SR Candidate Path's Path SID sub-TLV.

   Length

      This field is set to the length of the sub-TLV's Value field in
      octets.  If Headend and Endpoint fields are in IPv4 address format
      which is 4 octets long, it MUST be set to 40; If Headend and
      Endpoint fields are in IPv6 address format which is 16 octets
      long, it MUST be set to 64.

   Headend







Min & Peng              Expires 5 September 2022                [Page 5]

Internet-Draft          LSP Ping for SR Path SID              March 2022


      This field identifies the headend of an SR Policy, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The headend is a
      4-octet IPv4 address or a 16-octet IPv6 address.

   Color

      This field associates the SR Policy with an intent, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The color is a 4-octet
      numerical value.

   Endpoint

      This field identifies the endpoint of an SR Policy, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The endpoint is a
      4-octet IPv4 address or a 16-octet IPv6 address.

   Protocol-Origin

      This field identifies the component or protocol that originates or
      signals the candidate path for an SR Policy, the same as defined
      in Section 2.3 of [I-D.ietf-spring-segment-routing-policy].  The
      protocol-origin is a 1-octet value that follows the recommendation
      from Table 1 of Section 2.3 of
      [I-D.ietf-spring-segment-routing-policy], which specifies value 10
      for "PCEP", value 20 for "BGP SR Policy" and value 30 for "Via
      Configuration".

   Originator

      This field identifies the node which provisioned or signaled the
      candidate path for an SR Policy, the same as defined in
      Section 2.4 of [I-D.ietf-spring-segment-routing-policy].  The
      originator is a 20-octet numerical value formed by the
      concatenation of the fields of the tuple <ASN, node-address>,
      among which ASN is a 4-octet number and node address is a 16-octet
      value (an IPv6 address or an IPv4 address encoded in the lowest 4
      octets).  When Procotol-Origin is respectively "Via
      Configuration", or "PCEP", or "BGP SR Policy", the values of ASN
      and node address follow the specification in Section 2.4 of
      [I-D.ietf-spring-segment-routing-policy].

   Discriminator






Min & Peng              Expires 5 September 2022                [Page 6]

Internet-Draft          LSP Ping for SR Path SID              March 2022


      This field uniquely identifies a candidate path within the context
      of an SR policy, the same as defined in Section 2.5 of
      [I-D.ietf-spring-segment-routing-policy].  The discriminator is a
      4-octet value.  When Protocol-Origin is respectively "Via
      Configuration", or "PCEP", or "BGP SR Policy", the value of
      discriminator follows the specification in Section 2.5 of
      [I-D.ietf-spring-segment-routing-policy].

3.3.  SR Segment List's Path SID

   The format of SR Segment List's Path SID sub-TLV is as specified
   below:


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Type = TBD3          |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   ~                     Headend  (4/16 octets)                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Color  (4 octets)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   ~                    Endpoint  (4/16 octets)                    ~
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |Protocol-Origin|                    Reserved                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                                                               |
   |                  Originator  (20 octets)                      |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |               Discriminator  (4 octets)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Segment-List-ID  (4 octets)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                Figure 3: SR Segment List's Path SID sub-TLV

   Type

      This field is set to the value (TBD3) which indicates that it's an
      SR Segment List's Path SID sub-TLV.

   Length





Min & Peng              Expires 5 September 2022                [Page 7]

Internet-Draft          LSP Ping for SR Path SID              March 2022


      This field is set to the length of the sub-TLV's Value field in
      octets.  If Headend and Endpoint fields are in IPv4 address format
      which is 4 octets long, it MUST be set to 44; If Headend and
      Endpoint fields are in IPv6 address format which is 16 octets
      long, it MUST be set to 68.

   Headend

      This field identifies the headend of an SR Policy, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The headend is a
      4-octet IPv4 address or a 16-octet IPv6 address.

   Color

      This field associates the SR Policy with an intent, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The color is a 4-octet
      numerical value.

   Endpoint

      This field identifies the endpoint of an SR Policy, the same as
      defined in Section 2.1 of
      [I-D.ietf-spring-segment-routing-policy].  The endpoint is a
      4-octet IPv4 address or a 16-octet IPv6 address.

   Protocol-Origin

      This field identifies the component or protocol that originates or
      signals the candidate path for an SR Policy, the same as defined
      in Section 2.3 of [I-D.ietf-spring-segment-routing-policy].  The
      protocol-origin is a 1-octet value that follows the recommendation
      from Table 1 of Section 2.3 of
      [I-D.ietf-spring-segment-routing-policy], which specifies value 10
      for "PCEP", value 20 for "BGP SR Policy" and value 30 for "Via
      Configuration".

   Originator

      This field identifies the node which provisioned or signaled the
      candidate path for an SR Policy, the same as defined in
      Section 2.4 of [I-D.ietf-spring-segment-routing-policy].  The
      originator is a 20-octet numerical value formed by the
      concatenation of the fields of the tuple <ASN, node-address>,
      among which ASN is a 4-octet number and node address is a 16-octet
      value (an IPv6 address or an IPv4 address encoded in the lowest 4
      octets).  When Procotol-Origin is respectively "Via



Min & Peng              Expires 5 September 2022                [Page 8]

Internet-Draft          LSP Ping for SR Path SID              March 2022


      Configuration", or "PCEP", or "BGP SR Policy", the values of ASN
      and node address follow the specification in Section 2.4 of
      [I-D.ietf-spring-segment-routing-policy].

   Discriminator

      This field uniquely identifies a candidate path within the context
      of an SR policy, the same as defined in Section 2.5 of
      [I-D.ietf-spring-segment-routing-policy].  The discriminator is a
      4-octet value.  When Protocol-Origin is respectively "Via
      Configuration", or "PCEP", or "BGP SR Policy", the value of
      discriminator follows the specification in Section 2.5 of
      [I-D.ietf-spring-segment-routing-policy].

   Segment-List-ID

      This field identifies an SR path within the context of a candidate
      path of an SR Policy, the same as "Path ID" defined in Section 4.2
      of [I-D.ietf-pce-multipath], or "List Identifier" defined in
      Section 2.2 of [I-D.lp-idr-sr-path-protection].  The segment-list-
      ID is a 4-octet identifier of the corresponding segment list.

4.  Path-SID FEC Validation

   The MPLS LSP Ping procedures MAY be initiated by the headend of the
   Segment Routing path or a centralized topology-aware data plane
   monitoring system as described in [RFC8403].  For the Path-SID, the
   responder nodes that receive echo request and send echo reply MUST be
   the endpoint of the Segment Routing path.

   When an endpoint receives the LSP echo request packet with top FEC
   being the Path-SID, it SHOULD perform validity checks on the content
   of the Path-SID FEC sub-TLV.  The basic length check should be
   performed on the received FEC.


       SR Policy's Path SID
       ------------------
       Length = 12 or 36

       SR Candidate Path's Path SID
       ------------------
       Length = 40 or 64

       SR Segment List's Path SID
       ------------------
       Length = 44 or 68




Min & Peng              Expires 5 September 2022                [Page 9]

Internet-Draft          LSP Ping for SR Path SID              March 2022


   If a malformed FEC sub-TLV is received, then a return code of 1,
   "Malformed echo request received" as defined in [RFC8029] SHOULD be
   sent.  The below section augments the section 7.4 of [RFC8287].

      4a.  Segment Routing Path-SID Validation:

      If the Label-stack-depth is 0 and the Target FEC Stack sub-TLV at
      FEC-stack-depth is TBD1 (SR Policy's Path SID sub-TLV), {

      -  Set the Best-return-code to 10, "Mapping for this FEC is not
         the given label at stack-depth <RSC>" if any below conditions
         fail:

         o  Validate that the Path Segment ID is signaled or provisioned
            for the SR Policy {

            +  Validate that the signaled or provisioned headend, color
               and end-point for the Path SID, matches with the
               corresponding fields in the received SR Policy's Path SID
               sub-TLV.

            }

         }

      -  If all the above validations have passed, set the return code
         to 3 "Replying router is an egress for the FEC at stack-depth
         <RSC>".

      -  Set FEC-Status to 1 and return.

      }

      Else, if the Label-stack-depth is 0 and the Target FEC Stack sub-
      TLV at FEC-stack-depth is TBD2 (SR Candidate Path's Path SID sub-
      TLV), {

      -  Set the Best-return-code to 10, "Mapping for this FEC is not
         the given label at stack-depth <RSC>" if any below conditions
         fail:

         o  Validate that the Path Segment ID is signaled or provisioned
            for the SR Candidate Path {








Min & Peng              Expires 5 September 2022               [Page 10]

Internet-Draft          LSP Ping for SR Path SID              March 2022


            +  When the Protocol-Origin field in the received SR
               Candidate Path's Path SID sub-TLV is 10, "PCEP" is used
               as the signaling protocol.  And then validate that the
               Path Segment ID matches with the tuple identifying the SR
               Candidate Path within PCEP {

               *  Validate that the signaled headend, color, end-point,
                  originator ASN, originator address and discriminator
                  defined in [I-D.ietf-pce-segment-routing-policy-cp]
                  and [I-D.ietf-pce-sr-path-segment], for the Path SID,
                  matches with the corresponding fields in the received
                  SR Candidate Path's Path SID sub-TLV.

               }

            +  When the Protocol-Origin field in the received SR
               Candidate Path's Path SID sub-TLV is 20, "BGP SR Policy"
               is used as the signaling protocol.  And then validate
               that the Path Segment ID matches with the tuple
               identifying the SR Candidate Path within BGP SR Policy {

               *  Validate that the signaled headend, policy color,
                  endpoint, ASN, BGP Router-ID and distinguisher defined
                  in [I-D.ietf-idr-segment-routing-te-policy] and
                  [I-D.ietf-idr-sr-policy-path-segment], for the Path
                  SID, matches with the corresponding fields in the
                  received SR Candidate Path's Path SID sub-TLV.

               }

            +  When the Protocol-Origin field in the received SR
               Candidate Path's Path SID sub-TLV is 30, "Via
               Configuration" is used.  And then validate that the Path
               Segment ID matches with the tuple identifying the SR
               Candidate Path within Configuration {

               *  Validate that the provisioned headend, color,
                  endpoint, originator and discriminator defined in
                  [I-D.ietf-spring-sr-policy-yang], for the Path SID,
                  matches with the corresponding fields in the received
                  SR Candidate Path's Path SID sub-TLV.

               }

            }






Min & Peng              Expires 5 September 2022               [Page 11]

Internet-Draft          LSP Ping for SR Path SID              March 2022


      -  If all the above validations have passed, set the return code
         to 3 "Replying router is an egress for the FEC at stack-depth
         <RSC>".

      -  Set FEC-Status to 1 and return.

      }

      Else, if the Label-stack-depth is 0 and the Target FEC Stack sub-
      TLV at FEC-stack-depth is TBD3 (SR Segment List's Path SID sub-
      TLV), {

      -  Set the Best-return-code to 10, "Mapping for this FEC is not
         the given label at stack-depth <RSC>" if any below conditions
         fail:

         o  Validate that the Path Segment ID is signaled or provisioned
            for the SR Segment List {

            +  When the Protocol-Origin field in the received SR Segment
               List's Path SID sub-TLV is 10, "PCEP" is used as the
               signaling protocol.  And then validate that the Path
               Segment ID matches with the tuple identifying the SR
               Segment List within PCEP {

               *  Validate that the signaled headend, color, end-point,
                  originator ASN, originator address and discriminator
                  defined in [I-D.ietf-pce-segment-routing-policy-cp]
                  and [I-D.ietf-pce-sr-path-segment], and the signaled
                  Path ID defined in [I-D.ietf-pce-multipath], for the
                  Path SID, matches with the corresponding fields in the
                  received SR Segment List's Path SID sub-TLV.

               }

            +  When the Protocol-Origin field in the received SR Segment
               List's Path SID sub-TLV is 20, "BGP SR Policy" is used as
               the signaling protocol.  And then validate that the Path
               Segment ID matches with the tuple identifying the SR
               Segment List within BGP SR Policy {











Min & Peng              Expires 5 September 2022               [Page 12]

Internet-Draft          LSP Ping for SR Path SID              March 2022


               *  Validate that the signaled headend, policy color,
                  endpoint, ASN, BGP Router-ID and distinguisher defined
                  in [I-D.ietf-idr-segment-routing-te-policy] and
                  [I-D.ietf-idr-sr-policy-path-segment], and the
                  signaled List Identifier defined in
                  [I-D.lp-idr-sr-path-protection], for the Path SID,
                  matches with the corresponding fields in the received
                  SR Segment List's Path SID sub-TLV.

               }

            +  When the Protocol-Origin field in the received SR Segment
               List's Path SID sub-TLV is 30, "Via Configuration" is
               used.  And then validate that the Path Segment ID matches
               with the tuple identifying the SR Segment List within
               Configuration {

               *  Validate that the provisioned headend, color,
                  endpoint, originator, discriminator and Segment-List-
                  ID defined in [I-D.ietf-spring-sr-policy-yang], for
                  the Path SID, matches with the corresponding fields in
                  the received SR Segment List's Path SID sub-TLV.

               }

            }

      -  If all the above validations have passed, set the return code
         to 3 "Replying router is an egress for the FEC at stack-depth
         <RSC>".

      -  Set FEC-Status to 1 and return.

      }

5.  Security Considerations

   This document defines additional MPLS LSP Ping sub-TLVs and follows
   the mechanisms defined in [RFC8029].  All the security considerations
   defined in [RFC8029] will be applicable for this document and, in
   addition, they do not impose any additional security challenges to be
   considered.









Min & Peng              Expires 5 September 2022               [Page 13]

Internet-Draft          LSP Ping for SR Path SID              March 2022


6.  IANA Considerations

   IANA is requested to assign three new sub-TLVs from the "sub-TLVs for
   TLV Types 1, 16, and 21" subregistry of the "Multi-Protocol Label
   Switching (MPLS) Label Switched Paths (LSPs) Ping Parameters"
   registry [IANA].


     Sub-Type   Sub-TLV Name                    Reference
     --------   -----------------------------   ------------
      TBD1      SR Policy's Path SID            Section 3.1
      TBD2      SR Candidate Path's Path SID    Section 3.2
      TBD3      SR Segment List's Path SID      Section 3.3

7.  Acknowledgements

   The authors would like to acknowledge Detao Zhao for his thorough
   review and very helpful comments.

   The authors would like to acknowledge Yao Liu for the very helpful
   f2f discussion.

8.  References

8.1.  Normative References

   [I-D.ietf-spring-mpls-path-segment]
              Cheng, W., Li, H., Chen, M., Gandhi, R., and R. Zigler,
              "Path Segment in MPLS Based Segment Routing Network", Work
              in Progress, Internet-Draft, draft-ietf-spring-mpls-path-
              segment-07, 20 December 2021,
              <https://www.ietf.org/archive/id/draft-ietf-spring-mpls-
              path-segment-07.txt>.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC8029]  Kompella, K., Swallow, G., Pignataro, C., Ed., Kumar, N.,
              Aldrin, S., and M. Chen, "Detecting Multiprotocol Label
              Switched (MPLS) Data-Plane Failures", RFC 8029,
              DOI 10.17487/RFC8029, March 2017,
              <https://www.rfc-editor.org/info/rfc8029>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.



Min & Peng              Expires 5 September 2022               [Page 14]

Internet-Draft          LSP Ping for SR Path SID              March 2022


   [RFC8287]  Kumar, N., Ed., Pignataro, C., Ed., Swallow, G., Akiya,
              N., Kini, S., and M. Chen, "Label Switched Path (LSP)
              Ping/Traceroute for Segment Routing (SR) IGP-Prefix and
              IGP-Adjacency Segment Identifiers (SIDs) with MPLS Data
              Planes", RFC 8287, DOI 10.17487/RFC8287, December 2017,
              <https://www.rfc-editor.org/info/rfc8287>.

   [RFC8690]  Nainar, N., Pignataro, C., Iqbal, F., and A. Vainshtein,
              "Clarification of Segment ID Sub-TLV Length for RFC 8287",
              RFC 8690, DOI 10.17487/RFC8690, December 2019,
              <https://www.rfc-editor.org/info/rfc8690>.

8.2.  Informative References

   [I-D.ietf-idr-segment-routing-te-policy]
              Previdi, S., Filsfils, C., Talaulikar, K., Mattes, P.,
              Jain, D., and S. Lin, "Advertising Segment Routing
              Policies in BGP", Work in Progress, Internet-Draft, draft-
              ietf-idr-segment-routing-te-policy-14, 10 November 2021,
              <https://www.ietf.org/archive/id/draft-ietf-idr-segment-
              routing-te-policy-14.txt>.

   [I-D.ietf-idr-sr-policy-path-segment]
              Li, C., Li, Z., Yin, Y., Cheng, W., and K. Talaulikar, "SR
              Policy Extensions for Path Segment and Bidirectional
              Path", Work in Progress, Internet-Draft, draft-ietf-idr-
              sr-policy-path-segment-05, 23 January 2022,
              <https://www.ietf.org/archive/id/draft-ietf-idr-sr-policy-
              path-segment-05.txt>.

   [I-D.ietf-mpls-sr-epe-oam]
              Hegde, S., Arora, K., Srivastava, M., Ninan, S., and X.
              Xu, "Label Switched Path (LSP) Ping/Traceroute for Segment
              Routing (SR) Egress Peer Engineering Segment Identifiers
              (SIDs) with MPLS Data Planes", Work in Progress, Internet-
              Draft, draft-ietf-mpls-sr-epe-oam-04, 8 November 2021,
              <https://www.ietf.org/archive/id/draft-ietf-mpls-sr-epe-
              oam-04.txt>.

   [I-D.ietf-pce-multipath]
              Koldychev, M., Sivabalan, S., Saad, T., Beeram, V. P.,
              Bidgoli, H., Yadav, B., Peng, S., and G. Mishra, "PCEP
              Extensions for Signaling Multipath Information", Work in
              Progress, Internet-Draft, draft-ietf-pce-multipath-04, 25
              February 2022, <https://www.ietf.org/archive/id/draft-
              ietf-pce-multipath-04.txt>.





Min & Peng              Expires 5 September 2022               [Page 15]

Internet-Draft          LSP Ping for SR Path SID              March 2022


   [I-D.ietf-pce-segment-routing-policy-cp]
              Koldychev, M., Sivabalan, S., Barth, C., Peng, S., and H.
              Bidgoli, "PCEP extension to support Segment Routing Policy
              Candidate Paths", Work in Progress, Internet-Draft, draft-
              ietf-pce-segment-routing-policy-cp-06, 22 October 2021,
              <https://www.ietf.org/archive/id/draft-ietf-pce-segment-
              routing-policy-cp-06.txt>.

   [I-D.ietf-pce-sr-path-segment]
              Li, C., Chen, M., Cheng, W., Gandhi, R., and Q. Xiong,
              "Path Computation Element Communication Protocol (PCEP)
              Extension for Path Segment in Segment Routing (SR)", Work
              in Progress, Internet-Draft, draft-ietf-pce-sr-path-
              segment-05, 13 February 2022,
              <https://www.ietf.org/archive/id/draft-ietf-pce-sr-path-
              segment-05.txt>.

   [I-D.ietf-spring-segment-routing-policy]
              Filsfils, C., Talaulikar, K., Voyer, D., Bogdanov, A., and
              P. Mattes, "Segment Routing Policy Architecture", Work in
              Progress, Internet-Draft, draft-ietf-spring-segment-
              routing-policy-18, 17 February 2022,
              <https://www.ietf.org/archive/id/draft-ietf-spring-
              segment-routing-policy-18.txt>.

   [I-D.ietf-spring-sr-policy-yang]
              Raza, K., Sawaya, R., Shunwan, Z., Voyer, D., Durrani, M.,
              Matsushima, S., and V. P. Beeram, "YANG Data Model for
              Segment Routing Policy", Work in Progress, Internet-Draft,
              draft-ietf-spring-sr-policy-yang-01, 7 April 2021,
              <https://www.ietf.org/archive/id/draft-ietf-spring-sr-
              policy-yang-01.txt>.

   [I-D.lp-idr-sr-path-protection]
              Liu, Y. and S. Peng, "BGP Extensions of SR Policy for Path
              Protection", Work in Progress, Internet-Draft, draft-lp-
              idr-sr-path-protection-02, 19 December 2021,
              <https://www.ietf.org/archive/id/draft-lp-idr-sr-path-
              protection-02.txt>.

   [IANA]     Internet Assigned Numbers Authority (IANA), "Multi-
              Protocol Label Switching (MPLS) Label Switched Paths
              (LSPs) Ping Parameters", <http://www.iana.org/assignments/
              mpls-lsp-ping-parameters/>.







Min & Peng              Expires 5 September 2022               [Page 16]

Internet-Draft          LSP Ping for SR Path SID              March 2022


   [RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing Architecture", RFC 8402, DOI 10.17487/RFC8402,
              July 2018, <https://www.rfc-editor.org/info/rfc8402>.

   [RFC8403]  Geib, R., Ed., Filsfils, C., Pignataro, C., Ed., and N.
              Kumar, "A Scalable and Topology-Aware MPLS Data-Plane
              Monitoring System", RFC 8403, DOI 10.17487/RFC8403, July
              2018, <https://www.rfc-editor.org/info/rfc8403>.

Authors' Addresses

   Xiao Min
   ZTE Corp.
   Nanjing
   China
   Phone: +86 25 88013062
   Email: xiao.min2@zte.com.cn


   Shaofu Peng
   ZTE Corp.
   Nanjing
   China
   Email: peng.shaofu@zte.com.cn


























Min & Peng              Expires 5 September 2022               [Page 17]
